/***************************************Copyright(c)************************************************
****************************************************************************************************
***** 文    件 :Dev_SpiFlash.h
***** 设    计 :sevenblock
***** 描    述 :
***** 版    本 :V1.0
***** 时    间 :2017-05-03
***** 备    注 :
****************************************************************************************************
***************************************************************************************************/
#ifndef Dev_SpiFlash_H
#define Dev_SpiFlash_H

#ifndef Dev_SpiFlash_D
#define EX_Dev_SpiFlash		extern
#else
#define EX_Dev_SpiFlash
#endif

#ifdef __cplusplus
extern "C" {
#endif
/*****************************************宏定义****************************************************
***************************************************************************************************/
// FLASH特性字
#define M25PE16_MAXPAGE				512					// 共512页
#define M25PE16_PAGESIZE	    		(1024*4)			// 每页4K

/****************************************功能定义***************************************************
***************************************************************************************************/
EX_Dev_SpiFlash u8 SF_ErasePage(u32 cPage_addr);
EX_Dev_SpiFlash void SpiFlashChipErase(void);
EX_Dev_SpiFlash u8 SF_Read(u32 cOffset_addr, u8 *cArray, u16 cCount);
//EX_Dev_SpiFlash u8 SF_Read(u32 cPage_addr, u32 cInPage_addr, u8 *cArray, u16 cCount);
EX_Dev_SpiFlash u8 SF_Write(u32 cPage_addr, u32 cInPage_addr, u8  *cArray, u16 cCount,u8 cIsErase);

#ifdef __cplusplus
}
#endif
#endif
/****************************************End Of File************************************************
***************************************************************************************************/

