/***************************************Copyright(c)************************************************
****************************************************************************************************
***** 文    件 :Dev_Spi.c
***** 设    计 :sevenblock
***** 描    述 :
***** 版    本 :V1.0
***** 时    间 :2017-05-03
***** 备    注 :
****************************************************************************************************
***************************************************************************************************/
#define Dev_Spi_D
#include "..\block\app\App_Macro.h"

#define SPI_MISO								8

static u8 s_aSpiMisoInit;

/*
**********************************************************************************************************
** 名    称 ：Spi_Enable()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
void  Spi_Enable (u8 uCS)
{
	if(uCS == SPI_FLASH_CS)
	{
		if(s_aSpiMisoInit)
		{
			GPIO_Init(GPIOA, SPI_MISO, MUX_SPI);
			
			s_aSpiMisoInit = 0;
		}
	}
	else
	{
		if(s_aSpiMisoInit == 0)
		{
			GPIO_Init(GPIOA, SPI_MISO, OUTPUT);

			s_aSpiMisoInit = 1;
		}
	}
	
	GPIO_BitClr(GPIOA, uCS);
}
/*
**********************************************************************************************************
** 名    称 ：Spi_Disable()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
void  Spi_Disable (u8 uCS)
{
	GPIO_BitSet(GPIOA, uCS);
}
/*
**********************************************************************************************************
** 名    称 ：Spi_Send_Byte()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
void  Spi_Send_Byte (u8 ucData)
{
	SPI_MasterWrite(SPI0, &ucData, 1);
}

/*
**********************************************************************************************************
** 名    称 ：Spi_Get_Byte()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
u8 Spi_Get_Byte (void)
{
	u8 aTemp;
	
	SPI_MasterRead(SPI0, &aTemp, 1);

	return aTemp;
}

/*
**********************************************************************************************************
** 名    称 ：Spi_Comm()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
void  Spi_Comm(u8  *pucTxBuf, u16  ucTxNum,u8  *pucRxBuf, u16  ucRxNum)
{
    volatile  u8  ucTmp = 0;                                         /* 用于接收无效（不需要）数据   */

	if(ucTxNum > 0)
	{
	    while (ucTxNum--) 
		{
	        Spi_Send_Byte(*pucTxBuf++);                                         /* 连续写发送FIFO               */
	    }
	}
	
	if(ucRxNum > 0)
	{
	    while (ucRxNum--) 
		{
	        *pucRxBuf++ = Spi_Get_Byte();
	    }
	}
}

/*
**********************************************************************************************************
** 名    称 ：Spi_Init()
** 功    能 ：
** 入口参数 ：无 
** 出口参数 ：无
** 备    注 :
**********************************************************************************************************
*/
void  Spi_Init (void)
{
	STRUCT_SPI_FORMAT sframe;

	GPIO_BitSet(GPIOA, SPI_LCD_CS);
	GPIO_BitSet(GPIOA, SPI_FLASH_CS);

	GPIO_Init(GPIOA, SPI_LCD_CS, OUTPUT);
	GPIO_Init(GPIOA, SPI_FLASH_CS, OUTPUT);

	sframe.bBits = 8;
  	sframe.bFrame = MSB;
	sframe.bMasterEn = MASTER;
	sframe.bMode = MODE0;
	sframe.lSckFreq = 8000000;

	s_aSpiMisoInit = 0;
	
	SPI_Init(SPI0, SPI_MAP_A7A8A9, sframe, NULL, NULL);
    
    /*
     *  发送一个空数据，以使时钟线变为高电平，注意此时CS = 1
  */
  	
    Spi_Send_Byte(0xFF);
	
}

/****************************************End Of File************************************************
***************************************************************************************************/

