/***************************************Copyright(c)************************************************
****************************************************************************************************
***** 文    件 :Dev_FIFO.c
***** 设    计 :sevenblock
***** 描    述 :
***** 版    本 :V1.0
***** 时    间 :2017-05-03
***** 备    注 :
****************************************************************************************************
***************************************************************************************************/
#define Dev_FIFO_D
#include "..\block\app\App_Macro.h"


/*
****************************************************************************************************
** 名    称 ：Dev_FIFO_Init()
** 功    能 ：
** 入口参数 ：无
** 出口参数 ：无
** 返    回 ：
** 备    注 ：
****************************************************************************************************
*/
void Dev_FIFO_Init(STRUCT_COM_FIFO *t_puFifo, u8 *t_paBuf, u16 t_rSize)
{
	t_puFifo->m_pData = t_paBuf;
	t_puFifo->m_Depth = t_rSize;
	t_puFifo->m_ValidSize = 0;
	t_puFifo->m_InOffset = 0;
	t_puFifo->m_OutOffset = 0;
}

/*
****************************************************************************************************
** 名    称 ：Dev_FIFO_Put()
** 功    能 ：
** 入口参数 ：无
** 出口参数 ：无
** 返    回 ：
** 备    注 ：
****************************************************************************************************
*/
s32 Dev_FIFO_Put(STRUCT_COM_FIFO *t_puFifo, u8 *t_paData, u16 t_rDataLen)
{
	u16 i;
	
	if((t_puFifo->m_ValidSize + t_rDataLen) > t_puFifo->m_Depth)
	{
		return 1;
	}

	for(i=0;i<t_rDataLen;i++)
	{
		t_puFifo->m_pData[t_puFifo->m_InOffset++] = t_paData[i];

		if(t_puFifo->m_InOffset == t_puFifo->m_Depth)
		{
			t_puFifo->m_InOffset = 0;
		}

		t_puFifo->m_ValidSize++;
	}

	return 0;
}

/*
****************************************************************************************************
** 名    称 ：Dev_FIFO_Get()
** 功    能 ：
** 入口参数 ：无
** 出口参数 ：无
** 返    回 ：
** 备    注 ：
****************************************************************************************************
*/
s32 Dev_FIFO_Get(STRUCT_COM_FIFO *t_puFifo, u8 *t_paData, u16 t_rDataLen)
{
	u16 i;
	
	if(t_puFifo->m_ValidSize < t_rDataLen)
	{
		return 0;
	}
	
	for(i=0;i<t_rDataLen;i++)
	{
		t_paData[i] = t_puFifo->m_pData[t_puFifo->m_OutOffset++];

		if(t_puFifo->m_OutOffset == t_puFifo->m_Depth)
		{
			t_puFifo->m_OutOffset = 0;
		}

		t_puFifo->m_ValidSize--;
	}

	return 1;
}

/*
****************************************************************************************************
** 名    称 ：Dev_FIFO_FreeSize()
** 功    能 ：
** 入口参数 ：无
** 出口参数 ：无
** 返    回 ：
** 备    注 ：
****************************************************************************************************
*/
u16 Dev_FIFO_FreeSize(STRUCT_COM_FIFO *t_puFifo)
{
	return (t_puFifo->m_Depth - t_puFifo->m_ValidSize);
}

/****************************************End Of File************************************************
***************************************************************************************************/

